app/controllers/community_board_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."board_type_id" = 'cicposts'
SELECT "boards".* FROM "boards" WHERE "boards"."board_type_id" = 'cicposts' ORDER BY created_at_desc LIMIT 2
---
  def cicpost
    dc=Board.where(board_type_id: "cicposts")
    @boardList=dc.find(:all, :limit =>rowsPerPage, :order=>'created_at desc')

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @post = Board.find(params[:id])

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "boards" ("board_type_id", "created_at", "member_id", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["board_type_id", "cicposts"], ["created_at", Wed, 25 Mar 2015 16:30:51 UTC +00:00], ["member_id", 1], ["text", "ssssdf"], ["title", "asDAd"], ["updated_at", Wed, 25 Mar 2015 16:30:51 UTC +00:00]]
---
  def write_complete
    post = Board.new
    c = Member.where(id:session[:user_id])[0]
    post.writer=c.name
    post.board_type_id = params[:post_category]
    post.title = params[:post_title]
    post.text = params[:post_content]
    if post.save

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "boards" SET "board_type_id" = ?, "title" = ?, "text" = ?, "updated_at" = ? WHERE "boards"."id" = 4  [["board_type_id", nil], ["title", nil], ["text", nil], ["updated_at", Wed, 25 Mar 2015 14:41:04 UTC +00:00]]
---
  def edit_complete
    post =Board.find(params[:id])
    post.board_type_id = params[:post_category]
    post.title = params[:post_title]
    post.text = params[:post_content]
    if post.save

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "boards" WHERE "boards"."id" = ?  [["id", 1]]
---
  def delete_complete
    post = Board.find(params[:id])
    post.destroy

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "boards" SET "read_count" = COALESCE("read_count", 0) + 1 WHERE "boards"."id" = 5
---
  def viewWork
    @post = Board.find(params[:id])
    Board.increment_counter(:read_count, params[:id] ) # hits increase