app/controllers/useradd_controller.rb

  def login_complete
   user = HomeMember.where(name: params[:username])[0]
---
SELECT "home_members".* FROM "home_members" WHERE "home_members"."username" = 'aa'