app/controllers/useradd_controller.rb

INSERT INTO "home_members" ("created_at", "email", "mobile", "name", "password", "schoolnum", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Fri, 20 Mar 2015 11:15:56 UTC +00:00], ["email", ""], ["mobile", ""], ["name", "조승완"], ["password", "1"], ["schoolnum", "b"], ["updated_at", Fri, 20 Mar 2015 11:15:56 UTC +00:00]]
INSERT INTO "members" ("created_at", "email", "mobile", "name", "password", "pkid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Wed, 25 Mar 2015 07:07:54 UTC +00:00], ["email", ""], ["mobile", ""], ["name", "조승완"], ["password", "1"], ["pkid", "b1"], ["updated_at", Wed, 25 Mar 2015 07:07:54 UTC +00:00]]
SELECT "home_members".* FROM "home_members" WHERE "home_members"."schoolnum" = 'A889057'
---
  def signup_complete
   if(params[:agree])
      user = HomeMember.new
      user.schoolnum = params[:school_num]
      user.name = params[:username]
      user.email= params[:inputEmail]
      user.mobile = params[:inputPhone]
      if params[:password] == params[:retype_password]
        user.password = params[:password]
      if user.save
        flash[:alert] = "성공적으로 가입되었습니다."
		user = HomeMember.where(schoolnum: params[:school_num])[0]

SELECT "home_members".* FROM "home_members" WHERE "home_members"."schoolnum" IS NULL
---
  def login_complete
   user = HomeMember.where(schoolnum: params[:school_num])[0]